var Q = Object.defineProperty;
var q = (c, e, r) => e in c ? Q(c, e, {
    enumerable: !0,
    configurable: !0,
    writable: !0,
    value: r
}) : c[e] = r;
var a = (c, e, r) => q(c, typeof e != "symbol" ? e + "" : e, r);
function n() {
    var c = ["景门多主文书之事。景门临六，七宫主凶。", "小吉未", "山地剝", "994724TMtYUq", "生门属土，居东北方艮宫，正当立春之生，万物复苏，阳气回转，土生万物，所以古人命名为生门，大吉大利之门。", "不利经商、出行、赴任、修造、嫁娶，经商易破财，出入容易得病遇灾受伤，招惹是非。但收款索债效果很好；又宜于打猎和捕捉盗贼。伤门为木神，临坤二宫，艮八宫为木克土，大凶。凶门被迫(凶门临被克之宫)，则凶事尤甚。", "水澤節", "Stems", "有才华，攻于心计，有心眼，能屈能伸，管理型人员。指医生，医药。死门见心，出医生。", "#2e83f6", "戊: ", "風山漸", "WXYF2", "用黄布缝成6尺长、3尺宽的褥子铺在身下。", "开门: ", "火山旅", "代表有能力，也代表被人伤。搞企业的女性见伤门，为风云人物。", "澤天夬", "禀西方金，为荫佑之神，性阴匿暗昧。太阴之方可以闭城藏兵、避难。", "开门首先想到的是金属多的地方，炼钢厂，金银首饰店、铁轨、器械厂等等。", "休门属水，右边是木，意为水中之木，或者是长在水里的植物，这一重象意很少人会注意到。", "LateTrigrams2", "太阴: ", "澤水困", "雷地豫", "附子30克，肉苁蓉30克，菟丝子30克，干姜15，淮小麦5克。", "1090DIECPy", "89046AmenRo", "戊为阳土，为大地山川之土，性高亢质硬而向阳，生育万物。主人形体敦厚，四方脸，皮肤黄白，身体多肉，胖子。为人性情果敢豪杰、刚烈暴躁、憨厚或愚笨痴呆、行动迟缓。奇门中称戊为天武为天门，代表资本、钱财、土地、脸、鼻子、胸、乳房、肠胃、脾、屁股、肌肉、肌肤、(乙加戊落乾宫脚肥)性格忠厚、笨、大地、雾、矿石、大石头、水泥、矿产、(房檐上的草叫乙加戊)瓷器、玉器、横梁、屋梁、房子、地质学家、会计、建筑工人、建筑商、金融、黄金、金融机构、农场、城墙、高岗、墙面、桥、讲信用、有财源、经济好等。", "StemToCSBranch", "戌(西北)", "有能力，压力大，心情不好。代表受伤害，疾病，斗打等。", "坤為地", "庚: ", "TYZJ4", "天蓬: ", "甲戌己", "开门居西北乾宫，五行属金。乾卦是八卦之首，为天为父，于社会之首长；乾纳甲壬，乾位有亥，亥为甲木长生之地，甲又为十干之首，所以古人对应乾宫的门命名为开门，喻万物开始之意，为大吉大利之门。", "地水師", "SolarTermsNames", "主贵人，有贵人相帮。休闲之人，测人，为公务员，办公室，接待性事务性工作，退休，落衰地为闲散人员。禄地临休门，为公务员。测事情进度，则不吉，着急做不了。", "澤風大過", "胜光午", "传送申", "天辅: ", "禀东方木，为护卫之神，甲木之化气。其神性和平，专司婚姻、交易，媒牙和合之事，又为护卫之神。", "原名左辅星，与东北八宫艮卦相对应，阳星，五行属土。人们认为土能生万物，又正当春季万物萌生之时，故称之为吉星。", "丙为阳火，名为太阳之火，有光明天地功，其性刚烈威严，果敢欺霸。主人体态丰满，圆脸，少胡须，短发，皮肤白里透红。为人性情刚烈勇猛，不怒自威，工作清廉，能成大材，但难持久。奇门中称丙为天威，有雄威之义，代表权威之人、婚姻中第三者男人、情夫、嫖客、月奇、病灶浮肿，炎症部位、手肿、牙龈肿。代表火、太阳、饼、圆形的、红色的、悖、出乱子、红色的花朵、血液、发烧、丙加癸是酒鬼、红嘴唇、心脏血液、脚、男人、也代表女人、发烧友、发炎、窗、高处、炮火、圆脸、炉火、烧烤、烧伤、少男、强烈的希望、小肠、红绿灯、性感、眼镜、欲望、脾气大、急躁、见光的地方、发热的东西、熊猫眼(眼肿的意思)、火焰、流鼻血、超短裙、太阳能等。", "癸: ", "Hexagrams1", "雷山小過", "Relations", "代表官司，牵连，惊恐怪异，变化多端，羁留盘诘，虚伪，做梦，绳索，链条，捆绑，心狠手辣，罗网，牵缠，一切细长物品，妖魔鬼魅，虚幻不实，心惊肉跳等。", "CelestialAnimals", "用黑布缝成6尺长、3尺宽的褥子铺在身下。", "澤雷隨", "逢九天必出行，逢马必动，主最近要出门，出差或旅游。", "505gAQpYK", "原名巨门星，与西南方二宫坤卦相对应，阴星，五行属土。因与八门中死门相对应，认为它的出没与疾病流行有关，所以把它称为病星、凶星，奇门预测疾病一般以它为用神，看它落在何宫及其旺相休囚，来定病的部位及轻重愈后状况。", "旺于四季，相于夏季，休于秋季，囚于冬季，废于春季。", "主破财，冒险之事，见蓬必有风险，做贸易的见蓬多。指投资风险。测人不是好人，测事为破财被盗、抢了。", "一世卦", "1180942GCdIXG", "测得财看生门，不看戊。戊为自有的财、兜里的财。凡人临戊必破财。临生门发财机遇大。戊为花的钱，生门为赚的钱。", "旺于夏季，相于春季，休于四季，囚于秋季，废于冬季。", "大树下的土1份，河坝上的土1份，出生地村中央的土1份，河沟石坳里的土1份，龙王庙的土1份。若以上的土寻不到，则改用下方替代：黄芪90克，当归20克。", "杜门: ", "EightGateOrigin", "保密、不公开，闭塞不通，堵住了。杜字，画地为牢之意。代表监察、监督机关、执法机构、技术部门等等。", "禀中央土，为天乙之神，诸神之首，所到之处，百恶消散。事急可从值符所进临之方出，此谓“急则从神”。", "乾金之卦，其体属金。性刚而好斗，所主者，名正言顺之事，为至极之神。若得门得奇，万福咸吉。不得奇得门，也不为凶。威捍之神，利扬兵布阵，行军出兵，利鼓呐喊，张扬，公开，飞鸟，飞机，航天。", "休门: ", "火雷噬嗑", "二世卦", "風雷益", "无花果30克，花蕊石30克，麦饭石30克，钟乳石15克，蛋黄粉30克，香蕉干3克。", "太冲卯", "遊魂卦", "仁慈、慈爱、教化、多愁善感。没主见、三心二意，郁郁寡欢。", "33828JxPSDT", "死门: ", "小偷小摸，偷人，偷情，偷物等。玄武为看不见的小人。", "#ef9104", "玄武: ", "地天泰", "火地晉", "雷厉风行，敢作敢为，爽快，泼辣。突然间出现的事。冲动、莽撞。", "丁: ", "旺于秋季，相于四季，休于冬季，囚于春季，废于夏季。", "天柱: ", "離為火", "WuXing", "澤地萃", "凶门。不宜出行谋事，否则必遇惊恐；但宜寻求走失，追捕逃亡。惊门为金神，临三，四宫主大凶。惊门惊惶忧惧，多生怪异。", "#8b6d03", "BaMen", "歸魂卦", "EarlyTrigrams", "山水蒙", "LateTrigrams1", "身上带个金属首饰，以黄金为最佳。", "伤门: ", "ThreeSix", "五世卦", "代表有能力，顶梁柱，没他不行。放在哪儿都能撑起局面。有创造力，也有破坏力。口才好。", "15937020QZqphe", "功曹寅", "山澤損", "NineStar", "巽為風", "惊门居西方兑位，属金。正当秋分、寒露、霜降之时，金秋寒气肃杀，草木面临凋蔽，一片惊恐萧瑟之象；又兑卦为泽，为缺，为破损；又兑主口，主口舌官非，故古人将此门命名为惊门，与东方震宫伤门相对应。", "原名破军星，与西方七宫兑卦相对应，阴星，五行属金。人们认为它正当金秋肃杀之时，喜杀好战，与惊恐怪异、破坏毁折有关，故名为凶星。", "旺于冬季，相于秋季，休于春季，囚于夏季，废于四季。", "用白布缝成6尺长、3尺宽的褥子铺在身下。", "震為雷", "雷火豐", "水天需", "景门居南方离宫，属火。在家中为中女，在乾金为父，与丈夫中男坎水对冲，易动口舌，常有血光之事；又景门正当日升中天、大放光明之时，但烈日炎炎，虽夏季景色美丽，但难免有酷暑之忧；又景门所在离宫正南与正北坎宫休门相对，一个万物闭藏休息，一个万物繁茂争长，故古人命名为景门。", "原名文曲星，与东南四宫巽卦相对应，阳星，五行属木。人们认为它是天上的文曲星，与文化教育事业有关，故称为大吉之星。", "WangShuai", "原名武曲星，与四宫天辅星文曲星相对，处西北六宫乾位，阴星，五行属金。人们认为它能动能静，与乾卦为天为父为首长相应，长天心计，和领导才能、军事指挥、医疗治病有关，故称为大吉之星。", "SixInstruments", "河魁戌", "床头柜放一盏酥油灯并经常点亮。", "甲寅癸", "艮為山", "火天大有", "天水訟", "坤土之象，万物之母。为坚牢之神，性柔好静。九地之方，可以屯兵固守。", "風火家人", "坎為水", "#d30505", "辛: ", "惊门: ", "甲申庚", "JiuXing", "测合作，一方临蛇，不可信，也代表事物的牵连。测病，易神经出问题。", "3774869QosXxU", "天風姤", "预测用神临值符，则凶事也有惊无险。临值符代表有一定的社会地位，有贵人相帮，有靠山、救星。但值符不可空。测命，值符逢空则年命不保。", "8dOOmwY", "#07e930", "放在两片棉花中间，让福主母亲用绿布缝成6尺长、3尺宽的褥子铺在身下。", "用红布缝成6尺长、3尺宽的褥子铺在身下。", "BranchesColors", "山風蠱", "天芮: ", "六合: ", "風澤中孚", "开门四通八达，宜远行，见贵，求财等，百事吉利享通。开门为金神，如临震，巽二宫，为金克木，古代哲学思想认为“金木相克”，则不吉利。门克宫为迫，吉门被迫(吉门临被克之宫)，则吉事不成。", "甲辰壬", "龙骨60克，天冬60克，白菊花60克，云母石6克，芝麻6克，鱼骨一付阴干磨成粉。", "己: ", "代表长者，贵人，公吏，钱物，资本，银行，放款人，原告，领导，上司，核心人物，凝聚力等信息。", "丙: ", "TwelveStages", "澤山咸", "信息、音讯、消息。临景门，等待消息、音讯。代表工作计划，市场信息、电子电器、动画、电视。逢景门旺相出是非。代表道路，看出行路上有什么事，看景门，因为景门为音讯，而不是看庚。", "原名右弼星，与同方九宫离卦相对应，阴星，五行属火。人们认为天英星居离宫之位，烈火炎炎，性躁易暴，虽然如日升中天，在放光明，但又和血光之灾有关，故称为中平之星，或小凶之星。", "庚为阳金，名为剑戟之金，有刚健肃杀之力，其性刚质硬。主人形体瘦长，骨格健壮，长脸白皮肤，筋强骨健。为人性情刚健敏锐、有威严、坚忍不拔、能屈人而不屈于人。奇门遁甲中称庚为天狱为天刑，代表仇人、丈夫、公ān干警、道路、皮毛、大肠、骨骼、肺、大腿骼、道路、阻隔、阻挡、技术、虎、军人、背、打斗、刀、武器、佛、高个子体态长方、钢键锐力、威严、盆腔、收费站、脊骨、关口、黑社会、车祸、石块、墙角、技术过硬、凶猛等。", "EightGate", "不高兴，事物没生机。死人，坟墓，土地，办事不成，不痛快，心情不好。看阴宅用死门。", "三世卦", "辛为阴金，名为珠玉装饰之金，性软洁静。主人形体修长方正，皮肤白嫩，长脸凹腮，为人性情忠诚爽柔，温润秀气自尊但虚荣，意志稍不坚。奇门中称辛为天庭，代表罪人或犯过错误的人、错误、革命、变革、铁匠、工匠、白色、小石块、手表、斑点、刀具、电子产品、计算器、罪犯、肺、呼吸系统、看守所的狱警、金融界、五金制品、首饰、珠宝、首饰店、门窗、骨头、枪、武术、小路、腰、刑具、粮食、颗粒状的东西、诱惑。", "九天: ", "未(西南)", "生门: ", "丁为阴火，名为灯烛之火，性质柔弱，有照亮万户之功，为人为己。主人秀丽清高，肤白粉嫩，发细而长，额宽颏尖。为人性情和顺而有心计，体贴人情，洞察奸邪。奇门中称丁为玉女太阴，代一星奇。婚姻中第三者女人、情妇、jì女、三陪女、红色，花、耳丁、火、烟、吸烟、灯光、女孩、打电话、小颗粒的东西、丁有丙的含义、男丁、男小鞭、癸加丁是性行为、眼睛、红嘴唇、血、血管、直、马上达成、希望、丁的希望最好(乙是弯曲实现，丙子是出乱子实现)、高根鞋、画、樱桃、葡萄、肉丁、宫爆鸡丁、胸罩、针灸、扎针、手术刀、牙齿、牙医、香火、烧香、口子、有文化、脐、电子产品、幼儿、小孩、叮咬、盯人(一种动作，看得目不转睛)、路口、丁字路口、高处、瓜子脸、演员、辣椒、子弹、火山喷发等。", "登明亥", "TBGJT", "地山謙", "宜休息聚会，经商，嫁娶，参谒贵人，不可扬兵。休门为水神，临离九宫为水克火，古代哲学思想认为水火不相容，则不吉利。", "壬为阳水，名为江河湖海之水，通天河而周流不息，性猛而不收，难以回头。主人皮肤稍黑，大眼睛，走路摇摆，长发秀眉，为人性情柔顺而阴险，勇敢多智，纵欲任性，可共忧患难以同乐。奇门中称壬为天牢，代表不稳定的事物、牢狱、流动的东西、装在什么里就是什么东西、什么事情往回一想就是好事、变动、大水、自来水、热水器、瀑布、糊涂、迷糊、迷茫、柔性、智慧、动脉、血液、血管、流动的车、膀胱、风流、船、海边、码头、海港、海滩、海军、黑色的、怀孕、娱乐的地方、聚众、驾驶员、司机、运输行业、流动的云、门扇、养殖业、海产品、水上运动、鱼类、小孩、小偷、眼睛、演员、邮电行业、道路、鞋子、飘动等。", "旺于春季，相于冬季，休于夏季，囚于四季(即辰戌丑未月)，废于秋季。", "風天小畜", "休门居北方坎宫，属水。坎水得乾金之生，于人为中男，上有兄下有弟，从容休闲；又坎宫处冬季最寒冷季节，万物休息冬眠，故古人命名为休门，乃休养生息之地。为吉利之门。", "火風鼎", "太乙巳", "YueJiang", "1052KiJMdr", "山雷頤", "天澤履", "测事为事看不清，测病为查不出来。迷惑，看不见，糊涂。", "生旺，有名声，有名利。测终生，天英旺有名。落艮宫不吉，有名不想出名。落坤宫，全国出名，因坤主大地，主小百姓。急躁、暴躁。配合不当出坏名声，易发火，没有沉稳性。", "WXYF1", "出入此门，百事为凶，忌出行，修造，谋事，否则伤人损财。宜渔猎，行刑，吊丧。死门为土神，临一宫则主大凶。", "神后子", "禀西方金，为凶恶刚猛之神。性好杀，司兵戈争斗杀伐病死。须防敌方偷袭。得奇门无忌。", "牡蛎60克，龟板60克，龙骨60克，云母石6克，芝麻6克，鱼骨一付阴干磨成粉。", "天山遯", "利密谋策划，藏身。性格内向，喜暗中行事。多与女人阴私之事有关。", "Hexagrams2", "乙为阴木，名为花草之木，有装扮人间之美，质软柔弱，情满人间。主人身材苗条，男子微驼身，皮肤白嫩，骨肉松驰，瘦长脸。为人性情柔顺，重情仁慈，爱打扮，依附世情。奇门中称乙为天德，为仁德之君。代表日奇、女人、妻子、象是人在爬、头发、眉毛、耳朵、舌头、大脑的神经、血管、肠子、肩膀、胳膊、脖子、肩、腿、脚、手、手指、弯曲的东西。乙落离宫为头、血管有毛病。为护士、肝脏、月亮、艺术品、男性生殖器、小孩、蚯蚓、胡子、画、神经、木制的桥、树木、木制的门窗、桌子、椅子、床柜、弯曲的河流、蔬菜、领带、输卵管、中药、中医、草地、花草、蝴蝶、蔬菜类的食品、多足的动物、长大的希望、歌女、水果、腰身、柔软的身材、茶叶等。", "SixConflict", "本宮卦", "風地觀", "7041OyryVO", "疾病、伤灾。临天芮都有毛病。贪婪、大资本家、大财主，有田地庄园。", "CGSS", "水山蹇", "稳定性强，测运气，为无太大发展。测事，为过去发生的。测项目，为以前就在做的。时间长久的。旧事物，慢性子，需等待时机而做。", "大吉丑", "丑(东北)", "心情不好，有担心的事，恐慌、口舌是非，心惊肉跳。代表律师，教师，唱歌的等等。", "主房子、土地、生意。求财吉。田产、资本、效益。测疾病，遇外伤是好事，有生机能愈合。遇内病则不吉，癌症，肿块之类的病会继续生长。", "癸为阴水，名为雨露之水，性发生至静至弱，滋润万物。主人矮小黑丑，圆脸瘦肩，声调不高，为人性情阴柔怕事，多伤感，不能自主。奇门遁甲中称癸为天网，代表性及性生活有关之事、牢狱、小水、淋浴、饮料、咖啡、可乐、眼泪、哭泣、奶、尿尿、厕所、(癸加辛水珠)汤粥、污水、眼睛(水汪汪的大眼睛)、湿度大的雾气、(戊加癸是钱财都流了)洗浴用品、鞋子、头发、油类、鱼缸、下雨、子宫、足、女性用品、便池、鼻涕、蛋、黑色的发、黑色的眼睛、困难、足、静脉、血液、酒、(癸加己酒鬼，丁加己烟鬼，在坎宫女人来例假)sè情、肾、神经系统、化妆品、小孩子、精液。", "辰(东南)", "地風升", "天英: ", "蒺藜40克，独活20克，白术20克，薏米10克。", "ShiErCS", "山火賁", "水雷屯", "雷水解", "ShiErGuiShen", "LTToSSZ", "天任: ", "为打开的、开始。为有开口的东西。为开阔进取之人。为开心的人。为正在开口讲话的人等等。", "从魁酉", "乾為天", "禀北方水，为奸谗小盗之神。性好阴谋贼害，司盗贼逃亡口舌之事。须提防奸细盗贼。得奇门则无妨。", "其开朗平和，利交易，谈判，中介，合作等。又主华彩，车，书，酒食，宴会，婚姻等。", "禀南方火，为虚诈之神。性柔而口毒，司惊恐怪异之事。出腾蛇之方主精神恍惚，恶梦惊悸，得使得门则无妨。", "景门: ", "天火同人", "死门居西南坤宫，属土。死门与艮宫生门相对，万物春生秋死，春种秋收，故命名为死门。", "火水未濟", "雷天大壯", "天地否", "壬: ", "任劳任怨、勤勤恳恳，体力劳动者。固执、一根筋、不听人劝、不可教化。", "EightDivine", "算作凶门而倾于平。景门发扬振作而不久长。宜游戏竞赛。上书，渔猎无所得。"];
    return (n = function() {
        return c
    }
    )()
}
function s(c, e) {
    var r = n();
    return (s = function(M, w) {
        return r[M -= 196]
    }
    )(c, e)
}
var t = s;
(function() {
    for (var c = s, e = n(); ; )
        try {
            if (-parseInt(c(298)) / 1 + parseInt(c(357)) / 2 + parseInt(c(258)) / 3 * (parseInt(c(241)) / 4) + parseInt(c(352)) / 5 * (-parseInt(c(374)) / 6) + parseInt(c(199)) / 7 * (parseInt(c(202)) / 8) + parseInt(c(322)) / 9 * (-parseInt(c(321)) / 10) + parseInt(c(400)) / 11 === 553211)
                break;
            e.push(e.shift())
        } catch {
            e.push(e.shift())
        }
}
)();
var S, h, o, u, g, p, I, m, T, f, l, C, E, x, Y, d, G, J, X, B, v, O, W, b, y, D, L, Z, A, N, H, K;
K = t(302),
H = t(392),
N = t(394),
A = t(316),
Z = t(344),
L = t(253),
D = t(255),
y = t(346),
b = t(348),
W = t(206),
O = t(217),
v = t(334),
B = t(397),
X = t(416),
J = t(362),
G = t(293),
d = t(403),
Y = t(222),
x = t(277),
E = t(329),
C = t(272),
l = t(324),
f = t(240),
T = t(276),
m = t(231),
I = t(197),
p = t(390),
g = t(386),
u = t(414),
o = t(260),
h = t(246),
S = t(307);
class i {
}
a(i, K, ["", "甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"]),
a(i, "Branches", ["", "子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"]),
a(i, H, ["", "乾☰", "兌☱", "離☲", "震☳", "巽☴", "坎☵", "艮☶", "坤☷"]),
a(i, N, ["", "坎水", "坤土", "震木", "巽木", "", "乾金", "兌金", "艮土", "離火"]),
a(i, A, ["", "水", "地", "雷", "風", "", "天", "澤", "山", "火"]),
a(i, Z, [t(256), t(356), t(368), t(224), "四世卦", t(398), t(372), t(391)]),
a(i, L, ["", "", "", "", "", "", "", "", t(425), t(301), t(274), "水火既濟", "澤火革", t(410), "地火明夷", t(333), t(327), "地雷復", "地澤臨", t(379), t(289), t(312), t(411), "水地比", t(409), t(319), t(275), "雷風恆", t(269), "水風井", t(336), t(350), t(404), t(236), t(424), t(369), "天雷無妄", t(367), t(242), t(207), "", "", "", "", "", "", "", "", t(281), t(200), t(251), t(290), t(257), t(297), t(380), t(421), "兌為澤", t(318), t(387), t(218), t(261), t(232), t(345), "雷澤歸妹", t(420), t(273), "山天大畜", t(402), "火澤睽", t(243), t(210), t(306), t(385), t(310), t(238), t(288), t(393), "風水渙", t(422), t(286)]),
a(i, "SixCombine", [9, 17, 19, 25, 51, 57, 65, 73]),
a(i, D, [8, 16, 20, 24, 32, 36, 48, 56, 64, 72]),
a(i, y, ["", "父母", "兄弟", "子孫", "妻財", "官鬼"]),
a(i, b, ["", "青龍", "朱雀", "勾陳", "螣蛇", "白虎", "玄武"]),
a(i, "StemsColors", ["", "#07e930", t(203), t(426), t(426), t(389), t(389), t(377), t(377), t(304), t(304)]),
a(i, W, ["", t(304), t(389), t(203), t(203), t(389), t(426), "#d30505", t(389), "#ef9104", t(377), "#8b6d03", "#2e83f6"]),
a(i, O, ["None", "長生", "沐浴", "冠帶", "臨官", "帝旺", "衰", "病", "死", "墓", "絕", "胎", "養"]),
a(i, v, ["", "立春", "雨水", "驚蟄", "春分", "清明", "穀雨", "立夏", "小滿", "芒種", "夏至", "小暑", "大暑", "立秋", "處暑", "白露", "秋分", "寒露", "霜降", "立冬", "小雪", "大雪", "冬至", "小寒", "大寒"]),
a(i, "CelestialAnimalsColor", ["", t(203), t(426), t(389), "#8b6d03", t(377), "#2e83f6"]),
a(i, "IsIphone", !1),
a(i, "IsWechat", !1),
a(i, "WuLongDun", ["丙", "戊", "庚", "壬", "甲"]),
a(i, B, ["戊", "己", "庚", "辛", "壬", "癸", "丁", "丙", "乙"]),
a(i, X, ["甲子戊", t(331), t(196), "甲午辛", t(212), t(419)]),
a(i, "NineStarOrigin", ["", "蓬", "芮", "冲", "辅", "禽", "心", "柱", "任", "英"]),
a(i, J, ["", "休", "死", "伤", "杜", "", "开", "惊", "生", "景"]),
a(i, G, ["符", "蛇", "阴", "合", "虎", "武", "地", "天"]),
a(i, d, ["蓬", "任", "冲", "辅", "英", "芮", "柱", "心"]),
a(i, Y, ["休", "生", "伤", "杜", "景", "死", "惊", "开"]),
a(i, x, [1, 8, 3, 4, 9, 2, 7, 6]),
a(i, "TYZJ12", ["进", "曲", "狱", "丰", "空", "泣", "欹", "劫", "散", "破", "灵", "吾"]),
a(i, E, ["雷", "火", "风", "豹"]),
a(i, "ShiErDX", ["步斗", "天门", "阴兵", "阳斗", "丁甲", "阴斗", "人门", "神位", "地户", "阴山", "魂魄", "遁形"]),
a(i, "ShiErLX", ["身运", "兄弟", "夫妻", "子女", "财帛", "疾厄", "迁移", "奴仆", "官禄", "田宅", "福德", "父母"]),
a(i, C, ["长生", "沐浴", "冠带", "临官", "帝旺", "衰", "病", "死", "墓", "绝", "胎", "养"]),
a(i, l, [11, 6, 2, 9, 2, 9, 5, 0, 8, 3]),
a(i, "YZ9", ["财", "祸", "官", "贼", "孤", "灾", "相", "福", "败"]),
a(i, f, [t(248), t(263), t(401), t(371), "天罡辰", t(239), t(337), t(296), t(338), t(280), t(417), t(230)]),
a(i, T, ["贵人", "螣蛇", "朱雀", "六合", "勾陈", "青龙", "天空", "白虎", "太常", "玄武", "太阴", "天后"]),
a(i, "ShiErJianChu", ["闭", "建", "除", "满", "平", "定", "执", "破", "危", "成", "收", "开"]),
a(i, m, ["紫微", "六丁", "姚池", "大禹", "魁山", "天目", "伏雁", "元辰", "鬼魅", "六甲", "蚩尤", "戊己"]),
a(i, "ShiGan", {
    戊: [t(305), t(323)],
    己: [t(214), "己为阴土，为田园之土，有培木溶水之能，其性温质软，低洼向阴。主人形体单薄，瘦弱丑陋，忧愁之相，声音含糊重浊。为人性情静多动少，温顺沉静。奇门中称己为六合为明堂，代表坟地、阴沟、低洼之地、小肉、有戊的性质，嘴、耳坠、脑子、忠厚老实、朋友多、欲望、花花肠子、消化系统、乳头、身体、肚子、肛门、院落、阳台、肚脐附近、小个子、大便、肮脏、马桶、垃圾、地井下水道、坑道、地下室、菜园、低洼、盆地、饭、策划、打结、食物、面包、蛋糕、痘、肚脐眼、餐具、坟地、疤痕、弯曲的河流、幻想、杂乱、脾、水果、药丸等。"],
    庚: [t(328), t(221)],
    辛: [t(427), t(225)],
    壬: [t(291), t(234)],
    癸: [t(343), t(267)],
    丁: [t(382), t(229)],
    丙: [t(216), t(342)],
    乙: ["乙: ", t(254)]
}),
a(i, "BaShen", {
    符: ["值符: ", t(364), t(215), t(201)],
    蛇: ["螣蛇: ", t(284), t(347), t(198)],
    阴: [t(317), t(313), t(252)],
    合: [t(209), t(340), t(283)],
    虎: ["白虎: ", t(249), "杀伐，争斗，疾病，死丧，道路之事。威权，财帛，犬马，金银宝物，孝服，哭泣，凶恶，怪异，血光，骨折等。", t(326)],
    武: [t(378), t(282), t(376), t(244)],
    地: ["九地: ", t(423), t(262)],
    天: [t(226), t(365), t(351)]
}),
a(i, I, {
    蓬: [t(330), "原名贪狼星，与北方一宫坎卦相对应，阳星，五行属水。坎水正当隆冬季节，至寒至冷至暗，喜阴害阳，人们认为它和盗贼出没有关，所以把它称为凶星、盗星。", t(235), t(355)],
    任: [t(278), t(341), t(383), t(292)],
    冲: ["天冲: ", "原名禄存星，与东方三宫震卦相对应，阳星，五行属木。人们认为它有慈心造化，助人为乐之德，与农事活动有关，故把它称为吉星，但吉利程度不如天心、天任、天辅三星，所以有人叫它次吉之星。", t(359), t(381)],
    辅: [t(339), t(413), t(359), t(373)],
    英: [t(270), t(220), t(354), t(245)],
    芮: [t(208), t(353), t(383), t(259)],
    柱: [t(384), t(406), "旺于冬季，相于秋季，休于春季，囚于夏季，废于四季。", t(399)],
    心: ["天心: ", t(415), t(407), t(303)]
}),
a(i, p, {
    休: [t(366), t(237), t(233), t(335), t(315)],
    生: [t(228), t(299), "利于求财，特别是搞房地产、种植业、养殖业等。征战出行、嫁聚建造也为吉利。但不利埋葬治丧。宜营造，嫁娶，谋事，见贵等。生门为土神，如临坎一宫为土克水，则不吉利。", t(266), t(358)],
    伤: [t(396), "伤门居东方震宫，五行属木，正当卯月春分之后甲木帝旺之时，旺则易折；震卦主动，动则易伤；元帅甲子常隐于戊土之下，子与卯相刑，刑则受伤，故古人将与震宫对应的八门命名为伤门。伤门属凶门，主人遭疾病刑伤之象。", t(300), "受到伤害，身体受伤为伤灾，精神受伤为有伤脑筋的事。代表伤灾，击刑又逢马星，测终生运，逢伤为有能力。", t(311)],
    杜: [t(361), "杜门居东南巽宫，属木。巽为长女，受乾父之冲克，又克坤母，与父母皆不和，故在家中处事阻塞不利；又巽宫有辰土，既是水墓、土墓又是辛金之墓。", "杜门虽列入凶门，但偏于平门，也可出行，谒贵，宜于躲避藏身。在人事上多主具有检察性质的人或单位。杜门有闲塞阻滞之义。杜门为木神，临二，八宫则主凶。", t(363)],
    景: [t(285), t(412), t(294), t(295), t(219)],
    死: [t(375), t(287), t(247), t(223)],
    惊: [t(428), t(405), t(388), t(265)],
    开: [t(309), t(332), t(211), t(314), t(279)]
}),
a(i, g, ["木", "火", "土", "金", "水"]),
a(i, u, ["从弱", "身弱", "身强", "从旺", "未知"]),
a(i, "CaiKu", [t(325), t(264), t(268), t(227), t(325)]),
a(i, o, ["太岁", "青龙", "丧门", "六合", "官符", "小耗", "大耗", "朱雀", "白虎", "贵神", "病符", "吊客"]),
a(i, "SBHT", ["寅", "卯", "巳", "午", "戌", "丑", "申", "酉", "亥", "子"]),
a(i, h, [["防风20克，独活20克，蒺藜40克，山药10克。", t(271)], ["肉桂30克，附子30克，干姜15克，丁香30克，巴戟天3克，杜仲15克，红茶3克。", t(320)], [t(360)], [t(370), "丹参30克，赤芍30克，麦饭石30克，蒜片15克。"], [t(250), t(213)]]),
a(i, S, [[t(204), "养一盆发财树或戴一串木质手串。"], [t(205), t(418)], [t(308), "用锦囊装一点庄稼地的黄土带在身上。"], [t(408), t(395)], [t(349), "床头柜上放一碗井水。"]]);
export {i as C};
